# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
rng_seeded = np.random.default_rng(seed=23)

In [8]:
s1 = pd.Series(rng_seeded.integers(1, 4, 100))
s2 = pd.Series(rng_seeded.integers(1, 3, 100))
s3 = pd.Series(rng_seeded.integers(10000, 30000, 100))

In [21]:
s1

0     1
1     1
2     3
3     3
4     1
     ..
95    3
96    3
97    1
98    1
99    1
Length: 100, dtype: int64

In [10]:
s2

0     1
1     2
2     2
3     2
4     2
     ..
95    2
96    1
97    1
98    2
99    2
Length: 100, dtype: int64

In [11]:
s3

0     26440
1     14342
2     11144
3     16102
4     12544
      ...
95    22520
96    26535
97    23401
98    13794
99    13464
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [12]:
df = pd.concat([s1, s2, s3], axis=1)

In [13]:
df

    0  1      2
0   1  1  26440
1   1  2  14342
2   3  2  11144
3   3  2  16102
4   1  2  12544
.. .. ..    ...
95  3  2  22520
96  3  1  26535
97  1  1  23401
98  1  2  13794
99  1  2  13464

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
df = df.rename(columns={0: "bedrs", 1: "bathrs", 2: "price_sqr_meter"})

In [19]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            26440
1      1       2            14342
2      3       2            11144
3      3       2            16102
4      1       2            12544

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.DataFrame(pd.concat([s1, s2, s3], axis=0))

In [25]:
bigcolumn

        0
0       1
1       1
2       3
3       3
4       1
..    ...
95  22520
96  26535
97  23401
98  13794
99  13464

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [29]:
bigcolumn.index.size, bigcolumn.index.max()

(300, 99)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [38]:
# using .reindex() will not work since bigcolumn df has duplicate index labels

# drop = True will prevent the prev index labels to move into a new column
bigcolumn.reset_index(drop=True)

         0
0        1
1        1
2        3
3        3
4        1
..     ...
295  22520
296  26535
297  23401
298  13794
299  13464

[300 rows x 1 columns]